* rust-script usage

** rust-script example

#+begin_src rust :results output
#!/usr/bin/env rust-script
//! Dependencies can be specified in the script file itself as follows:
//!
//! ```cargo
//! [dependencies]
//! rand = "0.8.0"
//! ```

use rand::prelude::*;

fn main() {
    let x: u64 = random();
    println!("A random number: {}", x);
}
#+end_src

#+RESULTS:
: A random number: 1703957541194226929
